# GetSpecificationGroup Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetSpecificationGroup Method
FabricationConfiguration Class See Also
---
Gets the specification group from its identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string GetSpecificationGroup(
	int specId
)
```

Visual Basic
---
```text
Public Function GetSpecificationGroup ( _
	specId As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetSpecificationGroup(
	int specId
)
```

# ### Parameters
specId
    Type: System..::..Int32 The specification identifier.
# ### Return Value
The specification group.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace